IDEA StatiCa Open Model
CheckResultType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Check result type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum CheckResultType
Public Enumeration CheckResultType
public enum class CheckResultType
Members
Member name | Value | Description
Capacity | 0 |  calculation of capacity by the interaction diagram
Response | 1 |  calculation plane of deformation
Shear | 2 |  shear check
Torsion | 3 |  torsion check
Interaction | 4 |  interaction shear+torsion
Fatigue | 5 |  calculation - response for fatigue
StressLimitation | 6 |  stress limitation check
CrackWidth | 7 |  crack width check
Detailing | 8 |  detailing check
Stiffness | 9 |  stiffness
Deflection | 10 |  deflection
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace